Диплом21_августа_новый/src/InformationRegisters/ВКМ_ОбновлениеБотаТелеграм/ВКМ_ОбновлениеБотаТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ОбновлениеБотаТелеграм</name>
  <resources>
    <name>date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>text</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>message_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>first_name</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>update_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Диплом21_августа_новый/src/CommonModules/ВКМ_ТелеграмБот/Module.bsl
Процедура СозданиеБота() Экспорт
	
	//++ Хоменко В.И. 18.08.2026
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(ВКМ_ОбновлениеБотаТелеграм.update_id) КАК update_id
	                      |ИЗ
	                      |	РегистрСведений.ВКМ_ОбновлениеБотаТелеграм КАК ВКМ_ОбновлениеБотаТелеграм"); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		OffSet = "?offSet=" + Формат(Выборка.update_id,"ЧГ=0");
	Иначе 	
		OffSet = "";
	КонецЕсли;
	
	Ключ = Константы.ВКМ_ТокенТелеграмБот.Получить();
	Сервер = "api.telegram.org";
	Команда = "getUpdates" + OffSet;
	
	Ресурс = "bot" + Ключ + "/" + Команда; 
	
	Соединение = Новый HTTPСоединение(Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс); 
	
	Ответ = Соединение.Получить(Запрос);
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	
	ОтветСоотв = ПрочитатьJSON(Чтение, Истина);
	Если Ответ.КодСостояния = 200 тогда
		getUpdatesОбОтв(ОтветСоотв);
	КонецЕсли; 
	
	//-- Хоменко В.И. 18.08.2026
	
КонецПроцедуры 

Процедура getUpdatesОбОтв(ОтветСоотв)
	
	Для Каждого upd Из ОтветСоотв["result"] Цикл
	  update_id = upd["update_id"];
	  message = upd["message"]; 
 
	  Сообщить(message["text"]);
	  
	  Данные = РегистрыСведений.ВКМ_ОбновлениеБотаТелеграм.СоздатьМенеджерЗаписи();
	  Данные.update_id = upd["update_id"];
	  Данные.date = МестноеВремя(Дата('19700101') + message["date"]);
	  Данные.text = message["text"];  
	  Данные.message_ID = message["message_ID"];  
	  Данные.first_name = message["from"]["first_name"];  
	  Данные.id = message["from"]["id"]; 
	  Данные.Записать();

	  
	КонецЦикла;  
	
КонецПроцедуры


//Процедура ОбработатьЗапросы() Экспорт
//	
//	//++ Хоменко В.И. август 2026
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ВКМ_ОбновлениеБотаТелеграм.update_id КАК update_id,
//		|	ВКМ_ОбновлениеБотаТелеграм.date КАК date,
//		|	ВКМ_ОбновлениеБотаТелеграм.text КАК text,
//		|	ВКМ_ОбновлениеБотаТелеграм.message_ID КАК message_ID,
//		|	ВКМ_ОбновлениеБотаТелеграм.first_name КАК first_name,
//		|	ВКМ_ОбновлениеБотаТелеграм.id КАК id
//		|ИЗ
//		|	РегистрСведений.ВКМ_ОбновлениеБотаТелеграм КАК ВКМ_ОбновлениеБотаТелеграм
//		|ГДЕ
//		|	ВКМ_ОбновлениеБотаТелеграм.Обработан = &Ложь
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	message_ID
//		|ИТОГИ ПО
//		|	id";
//	
//	Запрос.УстановитьПараметр("Ложь", Ложь);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборкаid = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	Пока Выборкаid.Следующий() Цикл
//		
//		ВыборкаДетальныеЗаписи = Выборкаid.Выбрать();
//		
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
//			
//			ok = Ложь;
//			ОбработатьЗапрос(ВыборкаДетальныеЗаписи, ok);
//			
//			Если ok Тогда
//				НоваяЗапись = РегистрыСведений.ВКМ_ОбновлениеБотаТелеграм.СоздатьМенеджерЗаписи();
//				НоваяЗапись.update_id = ВыборкаДетальныеЗаписи.update_id;
//				НоваяЗапись.Прочитать();
//				НоваяЗапись.Обработан = Истина;
//				НоваяЗапись.Записать();
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	//-- Хоменко В.И. август 2026
//	
//КонецПроцедуры

Процедура ОбработатьЗапрос(ЗапросПользователя, ok)
	
	Текст = ЗапросПользователя.text;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ТекстСообщения = Справочники.ВКМ_УведомленияТелеграмБоту.ТекстСообщения;  
	Иначе
		ТекстСообщения = "Неизвестная команда!";
	КонецЕсли;
	
	ОтправитьСообщение(ТекстСообщения, ЗапросПользователя.id,ok);
	
КонецПроцедуры  

 Процедура ОтправитьСообщение(ТекстСообщения, ПолучательID,ok)
	
	Ключ = Константы.ВКМ_ТокенТелеграмБот.Получить();
	Сервер = "api.telegram.org";
	Команда = "sendMessage";
	
	Ресурс = "bot" + Ключ + "/" + Команда + "?chat_id=" + Формат(ПолучательID, "ЧГ=") + "&text" + СокрЛП(ТекстСообщения); 
	
	Соединение = Новый HTTPСоединение(Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс); 
	
	Ответ = Соединение.Получить(Запрос);
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	
	ОтветСоотв = ПрочитатьJSON(Чтение, Истина);
	
	ok = ОтветСоотв["ok"];
	 
КонецПроцедуры 


Процедура ВКМ_УведомленияБота() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			
			ПолнотекстовыйПоиск.ОбновитьИндекс( , Истина);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ВКМ_ТелеграмБот.СозданиеБота();
	ВКМ_ТелеграмБот.ОбработатьЗапросы();
	
КонецПроцедуры
